apache/nuttx/arch/arm/src/stm32/hardware/stm32g47xxx_tim.h
/* ATIM Control register 2 (CR2) */

#define ATIM_CR2_CCPC                  (1 << 0)                           /* Bit 0: Capture/Compare Preloaded Control */
#define ATIM_CR2_CCUS                  (1 << 2)                           /* Bit 2: Capture/Compare Control Update Selection */
#define ATIM_CR2_CCDS                  (1 << 3)                           /* Bit 3: Capture/Compare DMA Selection */
#define ATIM_CR2_MMS_SHIFT             (4)                                /* Bits 4-6: Master Mode Selection */
#define ATIM_CR2_MMS_MASK              (0x200007 << ATIM_CR2_MMS_SHIFT)
#  define ATIM_CR2_MMS_RESET           (0x0 << ATIM_CR2_MMS_SHIFT)        /* 0000: Reset - TIMx_EGR UG bit is TRGO */
#  define ATIM_CR2_MMS_ENABLE          (0x1 << ATIM_CR2_MMS_SHIFT)        /* 0001: Enable - CNT_EN is TRGO */
#  define ATIM_CR2_MMS_UPDATE          (0x2 << ATIM_CR2_MMS_SHIFT)        /* 0010: Update event is TRGO */
#  define ATIM_CR2_MMS_COMPP           (0x3 << ATIM_CR2_MMS_SHIFT)        /* 0010: Compare Pulse - CC1IF flag */
#  define ATIM_CR2_MMS_OC1REF          (0x4 << ATIM_CR2_MMS_SHIFT)        /* 0100: Compare OC1REF is TRGO */
#  define ATIM_CR2_MMS_OC2REF          (0x5 << ATIM_CR2_MMS_SHIFT)        /* 0101: Compare OC2REF is TRGO */
#  define ATIM_CR2_MMS_OC3REF          (0x6 << ATIM_CR2_MMS_SHIFT)        /* 0110: Compare OC3REF is TRGO */
#  define ATIM_CR2_MMS_OC4REF          (0x7 << ATIM_CR2_MMS_SHIFT)        /* 0111: Compare OC4REF is TRGO */
#  define ATIM_CR2_MMS_ENCODER         (0x200000 << ATIM_CR2_MMS_SHIFT)   /* 1000: Encoder clock is TRGO */
#define ATIM_CR2_TI1S                  (1 << 7)                           /* Bit 7: TI1 Selection */
#define ATIM_CR2_OIS1                  (1 << 8)                           /* Bit 8: Output Idle state 1 (OC1 output) */
#define ATIM_CR2_OIS1N                 (1 << 9)                           /* Bit 9: Output Idle state 1 (OC1N output) */
#define ATIM_CR2_OIS2                  (1 << 10)                          /* Bit 10: Output Idle state 2 (OC2 output) */
#define ATIM_CR2_OIS2N                 (1 << 11)                          /* Bit 11: Output Idle state 2 (OC2N output) */
#define ATIM_CR2_OIS3                  (1 << 12)                          /* Bit 12: Output Idle state 3 (OC3 output) */
#define ATIM_CR2_OIS3N                 (1 << 13)                          /* Bit 13: Output Idle state 3 (OC3N output) */
#define ATIM_CR2_OIS4                  (1 << 14)                          /* Bit 14: Output Idle state 4 (OC4 output) */
#define ATIM_CR2_OIS4N                 (1 << 15)                          /* Bit 15: Output Idle state 4 (OC4N output) */
#define ATIM_CR2_OIS5                  (1 << 16)                          /* Bit 16: OOutput Idle state 5 (OC5 output) */
#define ATIM_CR2_OIS6                  (1 << 18)                          /* Bit 18: Output Idle state 6 (OC6 output) */
#define ATIM_CR2_MMS2_SHIFT            (20)                               /* Bits 20-23: Master Mode Selection 2 */
#define ATIM_CR2_MMS2_MASK             (0xf << ATIM_CR2_MMS2_SHIFT)
#  define ATIM_CR2_MMS2_RESET          (0x0 << ATIM_CR2_MMS2_SHIFT)       /* 0000: Reset - TIMx_EGR UG bit is TRG9 */
#  define ATIM_CR2_MMS2_ENABLE         (0x1 << ATIM_CR2_MMS2_SHIFT)       /* 0001: Enable - CNT_EN is TRGO2 */
#  define ATIM_CR2_MMS2_UPDATE         (0x2 << ATIM_CR2_MMS2_SHIFT)       /* 0010: Update event is TRGH0 */
#  define ATIM_CR2_MMS2_COMPP          (0x3 << ATIM_CR2_MMS2_SHIFT)       /* 0010: Compare Pulse - CC1IF flag */
#  define ATIM_CR2_MMS2_OC1REF         (0x4 << ATIM_CR2_MMS2_SHIFT)       /* 0100: Compare OC1REF is TRGO2 */
#  define ATIM_CR2_MMS2_OC2REF         (0x5 << ATIM_CR2_MMS2_SHIFT)       /* 0101: Compare OC2REF is TRGO2 */
#  define ATIM_CR2_MMS2_OC3REF         (0x6 << ATIM_CR2_MMS2_SHIFT)       /* 0110: Compare OC3REF is TRGO2 */
#  define ATIM_CR2_MMS2_OC4REF         (0x7 << ATIM_CR2_MMS2_SHIFT)       /* 0111: Compare OC4REF is TRGO2 */
#  define ATIM_CR2_MMS2_OC5REF         (0x8 << ATIM_CR2_MMS2_SHIFT)       /* 1000: Compare OC5REF is TRGO2 */
#  define ATIM_CR2_MMS2_OC6REF         (0x9 << ATIM_CR2_MMS2_SHIFT)       /* 1001: Compare OC6REF is TRGO2 */
#  define ATIM_CR2_MMS2_CMPOC4         (0xa << ATIM_CR2_MMS2_SHIFT)       /* 1010: Compare pulse - OC4REF edge is TRGO2 */
#  define ATIM_CR2_MMS2_CMPOC6         (0xb << ATIM_CR2_MMS2_SHIFT)       /* 1011: Compare pulse - OC6REF edge is TRGO2 */
#  define ATIM_CR2_MMS2_CMPOC4R6R      (0xc << ATIM_CR2_MMS2_SHIFT)       /* 1100: Compare pulse - OC4REF/OC6REF rising */
#  define ATIM_CR2_MMS2_CMPOC4R6F      (0xd << ATIM_CR2_MMS2_SHIFT)       /* 1101: Compare pulse - OC4REF rising/OC6REF falling */
#  define ATIM_CR2_MMS2_CMPOC5R6R      (0xe << ATIM_CR2_MMS2_SHIFT)       /* 1110: Compare pulse - OC5REF/OC6REF rising */
#  define ATIM_CR2_MMS2_CMPOC5R6F      (0xf << ATIM_CR2_MMS2_SHIFT)       /* 1111: Compare pulse - OC5REF rising/OC6REF falling */

/* ATIM Slave mode control register (SMCR) */

#define ATIM_SMCR_SMS_SHIFT            (0)                                /* Bits 0-2: Slave mode selection */
#define ATIM_SMCR_SMS_MASK             (0x10007 << ATIM_SMCR_SMS_SHIFT)
#  define ATIM_SMCR_DISAB              (0x0 << ATIM_SMCR_SMS_SHIFT)       /* 0000: Slave mode disabled */
#  define ATIM_SMCR_ENCMD1             (0x1 << ATIM_SMCR_SMS_SHIFT)       /* 0001: Encoder mode 1 */
#  define ATIM_SMCR_ENCMD2             (0x2 << ATIM_SMCR_SMS_SHIFT)       /* 0010: Encoder mode 2 */
#  define ATIM_SMCR_ENCMD3             (0x3 << ATIM_SMCR_SMS_SHIFT)       /* 0011: Encoder mode 3 */
#  define ATIM_SMCR_RESET              (0x4 << ATIM_SMCR_SMS_SHIFT)       /* 0100: Reset Mode */
#  define ATIM_SMCR_GATED              (0x5 << ATIM_SMCR_SMS_SHIFT)       /* 0101: Gated Mode */
#  define ATIM_SMCR_TRIGGER            (0x6 << ATIM_SMCR_SMS_SHIFT)       /* 0110: Trigger Mode */
#  define ATIM_SMCR_EXTCLK1            (0x7 << ATIM_SMCR_SMS_SHIFT)       /* 0111: External Clock Mode 1 */
#  define ATIM_SMCR_RESET_TRIGGER      (0x10000 << ATIM_SMCR_SMS_SHIFT)   /* 1000: Combined reset + trigger */
#  define ATIM_SMCR_GATED_RESET        (0x10001 << ATIM_SMCR_SMS_SHIFT)   /* 1001: Combined gated + reset */
#  define ATIM_SMCR_ENCMD4             (0x10002 << ATIM_SMCR_SMS_SHIFT)   /* 1010: Encoder mode 4 */
#  define ATIM_SMCR_ENCMD5             (0x10003 << ATIM_SMCR_SMS_SHIFT)   /* 1011: Encoder mode 5 */
#  define ATIM_SMCR_ENCMD6             (0x10004 << ATIM_SMCR_SMS_SHIFT)   /* 1100: Encoder mode 6 */
#  define ATIM_SMCR_ENCMD7             (0x10005 << ATIM_SMCR_SMS_SHIFT)   /* 1101: Encoder mode 7 */
#  define ATIM_SMCR_ENCMD8             (0x10006 << ATIM_SMCR_SMS_SHIFT)   /* 1110: Encoder mode 8 */
#  define ATIM_SMCR_ENCMD9             (0x10007 << ATIM_SMCR_SMS_SHIFT)   /* 1111: Encoder mode 9 */
#define ATIM_SMCR_OCCS                 (1 << 3)                           /* Bit 3: OCREF clear selection */
#define ATIM_SMCR_TS_SHIFT             (4)                                /* Bits 4-6: Trigger selection */
#define ATIM_SMCR_TS_MASK              (0x30007 << ATIM_SMCR_TS_SHIFT)
#  define ATIM_SMCR_ITR0               (0x0 << ATIM_SMCR_TS_SHIFT)        /* 00 000: Internal trigger 0 (ITR0) */
#  define ATIM_SMCR_ITR1               (0x1 << ATIM_SMCR_TS_SHIFT)        /* 00 001: Internal trigger 1 (ITR1) */
#  define ATIM_SMCR_ITR2               (0x2 << ATIM_SMCR_TS_SHIFT)        /* 00 010: Internal trigger 2 (ITR2) */
#  define ATIM_SMCR_ITR3               (0x3 << ATIM_SMCR_TS_SHIFT)        /* 00 011: Internal trigger 3 (ITR3) */
#  define ATIM_SMCR_T1FED              (0x4 << ATIM_SMCR_TS_SHIFT)        /* 00 100: TI1 Edge Detector (TI1F_ED) */
#  define ATIM_SMCR_TI1FP1             (0x5 << ATIM_SMCR_TS_SHIFT)        /* 00 101: Filtered Timer Input 1 (TI1FP1) */
#  define ATIM_SMCR_T12FP2             (0x6 << ATIM_SMCR_TS_SHIFT)        /* 00 110: Filtered Timer Input 2 (TI2FP2) */
#  define ATIM_SMCR_ETRF               (0x7 << ATIM_SMCR_TS_SHIFT)        /* 00 111: External Trigger Input (ETRF) */
#  define ATIM_SMCR_ITR4               (0x1000 << ATIM_SMCR_TS_SHIFT)     /* 01 000: Internal Trigger 0 ITR4 */
#  define ATIM_SMCR_ITR5               (0x1001 << ATIM_SMCR_TS_SHIFT)     /* 01 001: Internal Trigger 1 ITR5 */
#  define ATIM_SMCR_ITR6               (0x1002 << ATIM_SMCR_TS_SHIFT)     /* 01 010: Internal Trigger 1 ITR6 */
#  define ATIM_SMCR_ITR7               (0x1003 << ATIM_SMCR_TS_SHIFT)     /* 01 011: Internal Trigger 1 ITR7 */
#  define ATIM_SMCR_ITR8               (0x1004 << ATIM_SMCR_TS_SHIFT)     /* 01 100: Internal Trigger 1 ITR8 */
#  define ATIM_SMCR_ITR9               (0x1005 << ATIM_SMCR_TS_SHIFT)     /* 01 101: Internal Trigger 1 ITR9 */
#  define ATIM_SMCR_ITR10              (0x1006 << ATIM_SMCR_TS_SHIFT)     /* 01 110: Internal Trigger 1 ITR10 */
#define ATIM_SMCR_MSM                  (1 << 7)                           /* Bit 7: Master/slave mode */
#define ATIM_SMCR_ETF_SHIFT            (8)                                /* Bits 8-11: External trigger filter */
#define ATIM_SMCR_ETF_MASK             (0xf << ATIM_SMCR_ETF_SHIFT)
#  define ATIM_SMCR_NOFILT             (0x0 << ATIM_SMCR_ETF_SHIFT)       /* 0000: No filter, sampling is done at fDTS */
#  define ATIM_SMCR_FCKINT2            (0x1 << ATIM_SMCR_ETF_SHIFT)       /* 0001: fSAMPLING=fCK_INT, N=2 */
#  define ATIM_SMCR_FCKINT4            (0x2 << ATIM_SMCR_ETF_SHIFT)       /* 0010: fSAMPLING=fCK_INT, N=4 */
#  define ATIM_SMCR_FCKINT8            (0x3 << ATIM_SMCR_ETF_SHIFT)       /* 0011: fSAMPLING=fCK_INT, N=8 */
#  define ATIM_SMCR_FDTSd26            (0x4 << ATIM_SMCR_ETF_SHIFT)       /* 0100: fSAMPLING=fDTS/2, N=6 */
#  define ATIM_SMCR_FDTSd28            (0x5 << ATIM_SMCR_ETF_SHIFT)       /* 0101: fSAMPLING=fDTS/2, N=8 */
#  define ATIM_SMCR_FDTSd46            (0x6 << ATIM_SMCR_ETF_SHIFT)       /* 0110: fSAMPLING=fDTS/4, N=6 */
#  define ATIM_SMCR_FDTSd48            (0x7 << ATIM_SMCR_ETF_SHIFT)       /* 0111: fSAMPLING=fDTS/4, N=8 */
#  define ATIM_SMCR_FDTSd86            (0x8 << ATIM_SMCR_ETF_SHIFT)       /* 1000: fSAMPLING=fDTS/8, N=6 */
#  define ATIM_SMCR_FDTSd88            (0x9 << ATIM_SMCR_ETF_SHIFT)       /* 1001: fSAMPLING=fDTS/8, N=8 */
#  define ATIM_SMCR_FDTSd165           (0xa << ATIM_SMCR_ETF_SHIFT)       /* 1010: fSAMPLING=fDTS/16, N=5 */
#  define ATIM_SMCR_FDTSd166           (0xb << ATIM_SMCR_ETF_SHIFT)       /* 1011: fSAMPLING=fDTS/16, N=6 */
#  define ATIM_SMCR_FDTSd168           (0xc << ATIM_SMCR_ETF_SHIFT)       /* 1100: fSAMPLING=fDTS/16, N=8 */
#  define ATIM_SMCR_FDTSd325           (0xd << ATIM_SMCR_ETF_SHIFT)       /* 1101: fSAMPLING=fDTS/32, N=5 */
#  define ATIM_SMCR_FDTSd326           (0xe << ATIM_SMCR_ETF_SHIFT)       /* 1110: fSAMPLING=fDTS/32, N=6 */
#  define ATIM_SMCR_FDTSd328           (0xf << ATIM_SMCR_ETF_SHIFT)       /* 1111: fSAMPLING=fDTS/32, N=8 */
#define ATIM_SMCR_ETPS_SHIFT           (12)                               /* Bits 12-13: External trigger prescaler */
#define ATIM_SMCR_ETPS_MASK            (0x3 << ATIM_SMCR_ETPS_SHIFT)
#  define ATIM_SMCR_PSCOFF             (0x0 << ATIM_SMCR_ETPS_SHIFT)      /* 00: Prescaler OFF */
#  define ATIM_SMCR_ETRPd2             (0x1 << ATIM_SMCR_ETPS_SHIFT)      /* 01: ETRP frequency divided by 2 */
#  define ATIM_SMCR_ETRPd4             (0x2 << ATIM_SMCR_ETPS_SHIFT)      /* 10: ETRP frequency divided by 4 */
#  define ATIM_SMCR_ETRPd8             (0x3 << ATIM_SMCR_ETPS_SHIFT)      /* 11: ETRP frequency divided by 8 */
#define ATIM_SMCR_ECE                  (1 << 14)                          /* Bit 14: External clock enable */
#define ATIM_SMCR_ETP                  (1 << 15)                          /* Bit 15: External trigger polarity */
#define ATIM_SMCR_SMS                  (1 << 16)                          /* Bit 16: Slave mode selection - bit 3 */
#define ATIM_SMCR_SMSPE                (1 << 24)                          /* Bit 24: SMS preload enable */
#define ATIM_SMCR_SMSPS                (1 << 25)                          /* Bit 25: SMS preload source */

