apache/nuttx/arch/arm/src/stm32/hardware/stm32g47xxx_tim.h
#define ATIM_CCMR_CCS_CCOUT            (0x0)                              /* 00: CCx channel  output */
#define ATIM_CCMR_CCS_CCIN1            (0x1)                              /* 01: CCx channel input, ICx is TIx */
#define ATIM_CCMR_CCS_CCIN2            (0x2)                              /* 10: CCx channel input, ICx is TIy */
#define ATIM_CCMR_CCS_CCINTRC          (0x3)                              /* 11: CCx channel input, ICx is TRC */

/* ATIM Common CCMR (unshifted) Compare Mode bit field definitions */

#define ATIM_CCMR_MODE_FRZN            (0x0)                              /* 0000: Frozen */
#define ATIM_CCMR_MODE_CHACT           (0x1)                              /* 0001: Channel x active on match */
#define ATIM_CCMR_MODE_CHINACT         (0x2)                              /* 0010: Channel x inactive on match */
#define ATIM_CCMR_MODE_OCREFTOG        (0x3)                              /* 0011: OCxREF toggle ATIM_CNT=ATIM_CCRx */
#define ATIM_CCMR_MODE_OCREFLO         (0x4)                              /* 0100: OCxREF forced low */
#define ATIM_CCMR_MODE_OCREFHI         (0x5)                              /* 0101: OCxREF forced high */
#define ATIM_CCMR_MODE_PWM1            (0x6)                              /* 0110: PWM mode 1 */
#define ATIM_CCMR_MODE_PWM2            (0x7)                              /* 0111: PWM mode 2 */
#define ATIM_CCMR_MODE_OPM1            (0x8)                              /* 1000: Retriggerable OPM mode 1 */
#define ATIM_CCMR_MODE_OPM2            (0x9)                              /* 1001: Retriggerable OPM mode 2 */
#define ATIM_CCMR_MODE_COMBINED1       (0xc)                              /* 1100: Combined PWM mode 1 */
#define ATIM_CCMR_MODE_COMBINED2       (0xd)                              /* 1101: Combined PWM mode 2 */
#define ATIM_CCMR_MODE_ASYMMETRIC1     (0xe)                              /* 1110: Asymmetric PWM mode 1 */
#define ATIM_CCMR_MODE_ASYMMETRIC2     (0xf)                              /* 1111: Asymmetric PWM mode 2 */

/* ATIM Capture/compare mode register 1 (CCMR1) - Input Capture Mode
 * Bits 0-1 and Bits 8-9 are same as Output Compare Mode
 */

#define ATIM_CCMR1_IC1PSC_SHIFT        (2)                                /* Bits 2-3: Input Capture 1 Prescaler */
#define ATIM_CCMR1_IC1PSC_MASK         (0x3 << ATIM_CCMR1_IC1PSC_SHIFT)   /* (See common (unshifted) bit field definitions below) */
#define ATIM_CCMR1_IC1F_SHIFT          (4)                                /* Bits 4-7: Input Capture 1 Filter */
#define ATIM_CCMR1_IC1F_MASK           (0x0f << ATIM_CCMR1_IC1F_SHIFT)    /* (See common (unshifted) bit field definitions below) */
#define ATIM_CCMR1_IC2PSC_SHIFT        (10)                               /* Bits 10-11: Input Capture 2 Prescaler */
#define ATIM_CCMR1_IC2PSC_MASK         (0x3 << ATIM_CCMR1_IC2PSC_SHIFT)   /* (See common (unshifted) bit field definitions below) */
#define ATIM_CCMR1_IC2F_SHIFT          (12)                               /* Bits 12-15: Input Capture 2 Filter */
#define ATIM_CCMR1_IC2F_MASK           (0x0f << ATIM_CCMR1_IC2F_SHIFT)    /* (See common (unshifted) bit field definitions below) */

/* Common CCMR (unshifted) Input Capture Prescaler bit-field definitions */

#define ATIM_CCMR_ICPSC_NOPSC          (0x0)                              /* 00: no prescaler, capture each edge */
#define ATIM_CCMR_ICPSC_EVENTS2        (0x1)                              /* 01: capture once every 2 events */
#define ATIM_CCMR_ICPSC_EVENTS4        (0x2)                              /* 10: capture once every 4 events */
#define ATIM_CCMR_ICPSC_EVENTS8        (0x3)                              /* 11: capture once every 8 events */

/* Common CCMR (unshifted) Input Capture Filter bit-field definitions */

#define ATIM_CCMR_ICF_NOFILT           (0x0)                              /* 0000: No filter, sampling at fDTS */
#define ATIM_CCMR_ICF_FCKINT2          (0x1)                              /* 0001: fSAMPLING=fCK_INT, N=2 */
#define ATIM_CCMR_ICF_FCKINT4          (0x2)                              /* 0010: fSAMPLING=fCK_INT, N=4 */
#define ATIM_CCMR_ICF_FCKINT8          (0x3)                              /* 0011: fSAMPLING=fCK_INT, N=8 */
#define ATIM_CCMR_ICF_FDTSd26          (0x4)                              /* 0100: fSAMPLING=fDTS/2, N=6 */
#define ATIM_CCMR_ICF_FDTSd28          (0x5)                              /* 0101: fSAMPLING=fDTS/2, N=8 */
#define ATIM_CCMR_ICF_FDTSd46          (0x6)                              /* 0110: fSAMPLING=fDTS/4, N=6 */
#define ATIM_CCMR_ICF_FDTSd48          (0x7)                              /* 0111: fSAMPLING=fDTS/4, N=8 */
#define ATIM_CCMR_ICF_FDTSd86          (0x8)                              /* 1000: fSAMPLING=fDTS/8, N=6 */
#define ATIM_CCMR_ICF_FDTSd88          (0x9)                              /* 1001: fSAMPLING=fDTS/8, N=8 */
#define ATIM_CCMR_ICF_FDTSd165         (0xa)                              /* 1010: fSAMPLING=fDTS/16, N=5 */
#define ATIM_CCMR_ICF_FDTSd166         (0xb)                              /* 1011: fSAMPLING=fDTS/16, N=6 */
#define ATIM_CCMR_ICF_FDTSd168         (0xc)                              /* 1100: fSAMPLING=fDTS/16, N=8 */
#define ATIM_CCMR_ICF_FDTSd325         (0xd)                              /* 1101: fSAMPLING=fDTS/32, N=5 */
#define ATIM_CCMR_ICF_FDTSd326         (0xe)                              /* 1110: fSAMPLING=fDTS/32, N=6 */
#define ATIM_CCMR_ICF_FDTSd328         (0xf)                              /* 1111: fSAMPLING=fDTS/32, N=8 */

/* ATIM Capture/compare mode register 2 (CCMR2) - Output Compare Mode */

#define ATIM_CCMR2_CC3S_SHIFT          (0)                                /* Bits 0-1: Capture/Compare 3 Selection */
#define ATIM_CCMR2_CC3S_MASK           (0x3 << ATIM_CCMR2_CC3S_SHIFT)     /* (See common (unshifted) bit field definitions above) */
#define ATIM_CCMR2_OC3FE               (1 << 2)                           /* Bit 2: Output Compare 3 Fast enable */
#define ATIM_CCMR2_OC3PE               (1 << 3)                           /* Bit 3: Output Compare 3 Preload enable */
#define ATIM_CCMR2_OC3M_SHIFT          (4)                                /* Bits 4-6: Output Compare 3 Mode */
#define ATIM_CCMR2_OC3M_MASK           (0x7 << ATIM_CCMR2_OC3M_SHIFT)     /* (See common (unshifted) bit field definitions above) */
#define ATIM_CCMR2_OC3CE               (1 << 7)                           /* Bit 7: Output Compare 3 Clear Enable */
#define ATIM_CCMR2_CC4S_SHIFT          (8)                                /* Bits 8-9: Capture/Compare 4 Selection */
#define ATIM_CCMR2_CC4S_MASK           (0x3 << ATIM_CCMR2_CC4S_SHIFT)     /* (See common (unshifted) bit field definitions above) */
#define ATIM_CCMR2_OC4FE               (1 << 10)                          /* Bit 10: Output Compare 4 Fast enable */
#define ATIM_CCMR2_OC4PE               (1 << 11)                          /* Bit 11: Output Compare 4 Preload enable */
#define ATIM_CCMR2_OC4M_SHIFT          (12)                               /* Bits 12-14: Output Compare 4 Mode */
#define ATIM_CCMR2_OC4M_MASK           (0x7 << ATIM_CCMR2_OC4M_SHIFT)     /* (See common (unshifted) bit field definitions above) */
#define ATIM_CCMR2_OC4CE               (1 << 15)                          /* Bit 15: Output Compare 4 Clear Enable */
#define ATIM_CCMR2_OC3M                (1 << 16)                          /* Bit 16: Output Compare 3 mode - bit 3 */
#define ATIM_CCMR2_OC4M                (1 << 24)                          /* Bit 24: Output Compare 4 mode - bit 3 */

