apache/nuttx/arch/arm/src/stm32/hardware/stm32g47xxx_tim.h
/* ATIM Capture/compare mode register 2 (CCMR2) - Input Capture Mode
 * Bits 0-1 and Bits 8-9 are same as Output Compare Mode
 */

#define ATIM_CCMR2_IC3PSC_SHIFT        (2)                                /* Bits 2-3: Input Capture 3 Prescaler */
#define ATIM_CCMR2_IC3PSC_MASK         (3 << ATIM_CCMR2_IC3PSC_SHIFT)     /* (See common (unshifted) bit field definitions above) */
#define ATIM_CCMR2_IC3F_SHIFT          (4)                                /* Bits 4-7: Input Capture 3 Filter */
#define ATIM_CCMR2_IC3F_MASK           (0x0f << ATIM_CCMR2_IC3F_SHIFT)    /* (See common (unshifted) bit field definitions above) */
#define ATIM_CCMR2_IC4PSC_SHIFT        (10)                               /* Bits 10-11: Input Capture 4 Prescaler */
#define ATIM_CCMR2_IC4PSC_MASK         (3 << ATIM_CCMR2_IC4PSC_SHIFT)     /* (See common (unshifted) bit field definitions above) */
#define ATIM_CCMR2_IC4F_SHIFT          (12)                               /* Bits 12-15: Input Capture 4 Filter */
#define ATIM_CCMR2_IC4F_MASK           (0x0f << ATIM_CCMR2_IC4F_SHIFT)    /* (See common (unshifted) bit field definitions above) */

/* ATIM Capture/compare mode register 3 (CCMR3) */

#define ATIM_CCMR3_OC5FE               (1 << 2)                           /* Bit 2: Output Compare 5 Fast enable */
#define ATIM_CCMR3_OC5PE               (1 << 3)                           /* Bit 3: Output Compare 5 Preload enable */
#define ATIM_CCMR3_OC5M_SHIFT          (4)                                /* Bits 4-6: Output Compare 5 Mode */
#define ATIM_CCMR3_OC5M_MASK           (0x7 << ATIM_CCMR3_OC5M_SHIFT)     /* (See common (unshifted) bit field definitions above) */
#define ATIM_CCMR3_OC5CE               (1 << 7)                           /* Bit 7: Output Compare 5 Clear Enable */
#define ATIM_CCMR3_OC6FE               (1 << 10)                          /* Bit 10: Output Compare 6 Fast enable */
#define ATIM_CCMR3_OC6PE               (1 << 11)                          /* Bit 11: Output Compare 6 Preload enable */
#define ATIM_CCMR3_OC6M_SHIFT          (12)                               /* Bits 12-14: Output Compare 7 Mode */
#define ATIM_CCMR3_OC6M_MASK           (0x7 << ATIM_CCMR3_OC6M_SHIFT)     /* (See common (unshifted) bit field definitions above) */
#define ATIM_CCMR3_OC6CE               (1 << 15)                          /* Bit 15: Output Compare 7 Clear Enable */
#define ATIM_CCMR3_OC5M                (1 << 16)                          /* Bit 16: Output Compare 5 mode - bit 3 */
#define ATIM_CCMR3_OC6M                (1 << 24)                          /* Bit 24: Output Compare 6 mode - bit 3 */

/* ATIM Capture/compare enable register (CCER) */

#define ATIM_CCER_CC1E                 (1 << 0)                           /* Bit 0: Capture/Compare 1 Output Enable */
#define ATIM_CCER_CC1P                 (1 << 1)                           /* Bit 1: Capture/Compare 1 Output Polarity */
#define ATIM_CCER_CC1NE                (1 << 2)                           /* Bit 2: Capture/Compare 1 Complementary Output Enable */
#define ATIM_CCER_CC1NP                (1 << 3)                           /* Bit 3: Capture/Compare 1 Complementary Output Polarity */
#define ATIM_CCER_CC2E                 (1 << 4)                           /* Bit 4: Capture/Compare 2 Output Enable */
#define ATIM_CCER_CC2P                 (1 << 5)                           /* Bit 5: Capture/Compare 2 Output Polarity */
#define ATIM_CCER_CC2NE                (1 << 6)                           /* Bit 6: Capture/Compare 2 Complementary Output Enable */
#define ATIM_CCER_CC2NP                (1 << 7)                           /* Bit 7: Capture/Compare 2 Complementary Output Polarity */
#define ATIM_CCER_CC3E                 (1 << 8)                           /* Bit 8: Capture/Compare 3 Output Enable */
#define ATIM_CCER_CC3P                 (1 << 9)                           /* Bit 9: Capture/Compare 3 Output Polarity */
#define ATIM_CCER_CC3NE                (1 << 10)                          /* Bit 10: Capture/Compare 3 Complementary Output Enable */
#define ATIM_CCER_CC3NP                (1 << 11)                          /* Bit 11: Capture/Compare 3 Complementary Output Polarity */
#define ATIM_CCER_CC4E                 (1 << 12)                          /* Bit 12: Capture/Compare 4 Output Enable */
#define ATIM_CCER_CC4P                 (1 << 13)                          /* Bit 13: Capture/Compare 4 Output Polarity */
#define ATIM_CCER_CC4NP                (1 << 15)                          /* Bit 15: Capture/Compare 4 Complementary Output Polarity */
#define ATIM_CCER_CC5E                 (1 << 16)                          /* Bit 16: Capture/Compare 5 Output Enable */
#define ATIM_CCER_CC5P                 (1 << 17)                          /* Bit 17: Capture/Compare 5 Output Polarity */
#define ATIM_CCER_CC6E                 (1 << 20)                          /* Bit 20: Capture/Compare 6 Output Enable */
#define ATIM_CCER_CC6P                 (1 << 21)                          /* Bit 21: Capture/Compare 6 Output Polarity */

/* ATIM Counter (CNT) */

#define ATIM_CNT_SHIFT                 (0)                                /* Bits 0-15: Timer counter value */
#define ATIM_CNT_MASK                  (0xffff << ATIM_CNT_SHIFT)
#define ATIM_CCER_UIFCPY               (1 << 31)                          /* Bit 31: UIF copy */

/* ATIM Prescaler (PSC) */

#define ATIM_PSC_SHIFT                 (0)
#define ATIM_PSC_MASK                  (0xffff << ATIM_PSC_SHIFT)         /* Bits 0-15: Prescaler value */

/* ATIM Auto-reload register (ARR) */

#define ATIM_ARR_SHIFT                 (0)
#define ATIM_ARR_MASK                  (0xffffffff << ATIM_ARR_SHIFT)     /* Bits 0-31: Auto reload register */

/* ATIM Repetition counter register (RCR) */

#define ATIM_RCR_SHIFT                 (0)
#define ATIM_RCR_MASK                  (0xffff << ATIM_RCR_SHIFT)         /* Bits 0-15: Repetition counter register */

/* ATIM Capture/compare register 1 (CCR1 - CCR6) */

#define ATIM_CCR_SHIFT                 (0)
#define ATIM_CCR_MASK                  (0xfffff << ATIM_CCR_SHIFT)        /* Bits 0-19: Capture/compare 1 value */
#define ATIM_CCR5_GC5C1                (1 << 29)                          /* CCR5 only, Bit 29: Group Channel 5 and Channel 1 */
#define ATIM_CCR5_GC5C2                (1 << 30)                          /* CCR5 only, Bit 30: Group Channel 5 and Channel 2 */
#define ATIM_CCR5_GC5C3                (1 << 31)                          /* CCR5 only, Bit 31: Group Channel 5 and Channel 3 */

/* ATIM Break and dead-time register (BDTR) */

#define ATIM_BDTR_DTG_SHIFT            (0)                                /* Bits 0-7: Dead-Time Generator set-up */
#define ATIM_BDTR_DTG_MASK             (0xff << ATIM_BDTR_DTG_SHIFT)
#define ATIM_BDTR_LOCK_SHIFT           (8)                                /* Bits 8-9: Lock Configuration */
#define ATIM_BDTR_LOCK_MASK            (3 << ATIM_BDTR_LOCK_SHIFT)
#  define ATIM_BDTR_LOCKOFF            (0 << ATIM_BDTR_LOCK_SHIFT)        /* 00: LOCK OFF - No bit is write protected */
#  define ATIM_BDTR_LOCK1              (1 << ATIM_BDTR_LOCK_SHIFT)        /* 01: LOCK Level 1 protection */
#  define ATIM_BDTR_LOCK2              (2 << ATIM_BDTR_LOCK_SHIFT)        /* 10: LOCK Level 2 protection */
#  define ATIM_BDTR_LOCK3              (3 << ATIM_BDTR_LOCK_SHIFT)        /* 11: LOCK Level 3 protection */
#define ATIM_BDTR_OSSI                 (1 << 10)                          /* Bit 10: Off-State Selection for Idle mode */
#define ATIM_BDTR_OSSR                 (1 << 11)                          /* Bit 11: Off-State Selection for Run mode */
#define ATIM_BDTR_BKE                  (1 << 12)                          /* Bit 12: Break enable */
#define ATIM_BDTR_BKP                  (1 << 13)                          /* Bit 13: Break Polarity */
#define ATIM_BDTR_AOE                  (1 << 14)                          /* Bit 14: Automatic Output enable */
#define ATIM_BDTR_MOE                  (1 << 15)                          /* Bit 15: Main Output enable */

#define ATIM_BDTR_BKF_SHIFT            (16)                               /* Bits 16-19: Break filter */
#define ATIM_BDTR_BKF_MASK             (15 << ATIM_BDTR_BKF_SHIFT)
#  define ATIM_BDTR_BKF_NOFILT         (0 << ATIM_BDTR_BKF_SHIFT)         /* 0000: No filter, BRK acts asynchronously */
#  define ATIM_BDTR_BKF_FCKINT2        (1 << ATIM_BDTR_BKF_SHIFT)         /* 0001: fSAMPLING=fCK_INT, N=2 */
#  define ATIM_BDTR_BKF_FCKINT4        (2 << ATIM_BDTR_BKF_SHIFT)         /* 0010: fSAMPLING=fCK_INT, N=4 */
#  define ATIM_BDTR_BKF_FCKINT8        (3 << ATIM_BDTR_BKF_SHIFT)         /* 0011: fSAMPLING=fCK_INT, N=8 */
#  define ATIM_BDTR_BKF_FDTSd26        (4 << ATIM_BDTR_BKF_SHIFT)         /* 0100: fSAMPLING=fDTS/2, N=6 */
#  define ATIM_BDTR_BKF_FDTSd28        (5 << ATIM_BDTR_BKF_SHIFT)         /* 0101: fSAMPLING=fDTS/2, N=8 */
#  define ATIM_BDTR_BKF_FDTSd36        (6 << ATIM_BDTR_BKF_SHIFT)         /* 0110: fSAMPLING=fDTS/4, N=6 */
#  define ATIM_BDTR_BKF_FDTSd38        (7 << ATIM_BDTR_BKF_SHIFT)         /* 0111: fSAMPLING=fDTS/4, N=8 */
#  define ATIM_BDTR_BKF_FDTSd86        (8 << ATIM_BDTR_BKF_SHIFT)         /* 1000: fSAMPLING=fDTS/8, N=6 */
#  define ATIM_BDTR_BKF_FDTSd88        (9 << ATIM_BDTR_BKF_SHIFT)         /* 1001: fSAMPLING=fDTS/8, N=8 */
#  define ATIM_BDTR_BKF_FDTSd165       (10 << ATIM_BDTR_BKF_SHIFT)        /* 1010: fSAMPLING=fDTS/16, N=5 */
#  define ATIM_BDTR_BKF_FDTSd166       (11 << ATIM_BDTR_BKF_SHIFT)        /* 1011: fSAMPLING=fDTS/16, N=6 */
#  define ATIM_BDTR_BKF_FDTSd168       (12 << ATIM_BDTR_BKF_SHIFT)        /* 1100: fSAMPLING=fDTS/16, N=8 */
#  define ATIM_BDTR_BKF_FDTSd325       (13 << ATIM_BDTR_BKF_SHIFT)        /* 1101: fSAMPLING=fDTS/32, N=5 */
#  define ATIM_BDTR_BKF_FDTSd326       (14 << ATIM_BDTR_BKF_SHIFT)        /* 1110: fSAMPLING=fDTS/32, N=6 */
#  define ATIM_BDTR_BKF_FDTSd328       (15 << ATIM_BDTR_BKF_SHIFT)        /* 1111: fSAMPLING=fDTS/32, N=8 */
#define ATIM_BDTR_BK2F_SHIFT           (20)                               /* Bits 20-23: Break 2 filter */
#define ATIM_BDTR_BK2F_MASK            (15 << ATIM_BDTR_BK2F_SHIFT)
#  define ATIM_BDTR_BK2F_NOFILT        (0 << ATIM_BDTR_BK2F_SHIFT)        /* 0000: No filter, BRK 2 acts asynchronously */
#  define ATIM_BDTR_BK2F_FCKINT2       (1 << ATIM_BDTR_BK2F_SHIFT)        /* 0001: fSAMPLING=fCK_INT, N=2 */
#  define ATIM_BDTR_BK2F_FCKINT4       (2 << ATIM_BDTR_BK2F_SHIFT)        /* 0010: fSAMPLING=fCK_INT, N=4 */
#  define ATIM_BDTR_BK2F_FCKINT8       (3 << ATIM_BDTR_BK2F_SHIFT)        /* 0011: fSAMPLING=fCK_INT, N=8 */
#  define ATIM_BDTR_BK2F_FDTSd26       (4 << ATIM_BDTR_BK2F_SHIFT)        /* 0100: fSAMPLING=fDTS/2, N=6 */
#  define ATIM_BDTR_BK2F_FDTSd28       (5 << ATIM_BDTR_BK2F_SHIFT)        /* 0101: fSAMPLING=fDTS/2, N=8 */
#  define ATIM_BDTR_BK2F_FDTSd36       (6 << ATIM_BDTR_BK2F_SHIFT)        /* 0110: fSAMPLING=fDTS/4, N=6 */
#  define ATIM_BDTR_BK2F_FDTSd38       (7 << ATIM_BDTR_BK2F_SHIFT)        /* 0111: fSAMPLING=fDTS/4, N=8 */
#  define ATIM_BDTR_BK2F_FDTSd86       (8 << ATIM_BDTR_BK2F_SHIFT)        /* 1000: fSAMPLING=fDTS/8, N=6 */
#  define ATIM_BDTR_BK2F_FDTSd88       (9 << ATIM_BDTR_BK2F_SHIFT)        /* 1001: fSAMPLING=fDTS/8, N=8 */
#  define ATIM_BDTR_BK2F_FDTSd165      (10 << ATIM_BDTR_BK2F_SHIFT)       /* 1010: fSAMPLING=fDTS/16, N=5 */
#  define ATIM_BDTR_BK2F_FDTSd166      (11 << ATIM_BDTR_BK2F_SHIFT)       /* 1011: fSAMPLING=fDTS/16, N=6 */
#  define ATIM_BDTR_BK2F_FDTSd168      (12 << ATIM_BDTR_BK2F_SHIFT)       /* 1100: fSAMPLING=fDTS/16, N=8 */
#  define ATIM_BDTR_BK2F_FDTSd325      (13 << ATIM_BDTR_BK2F_SHIFT)       /* 1101: fSAMPLING=fDTS/32, N=5 */
#  define ATIM_BDTR_BK2F_FDTSd326      (14 << ATIM_BDTR_BK2F_SHIFT)       /* 1110: fSAMPLING=fDTS/32, N=6 */
#  define ATIM_BDTR_BK2F_FDTSd328      (15 << ATIM_BDTR_BK2F_SHIFT)       /* 1111: fSAMPLING=fDTS/32, N=8 */
#define ATIM_BDTR_BK2E                 (1 << 24)                          /* Bit 24: Break 2 enable */
#define ATIM_BDTR_BK2P                 (1 << 25)                          /* Bit 25: Break 2 polarity */
#define ATIM_BDTR_BK_DSRM              (1 << 26)                          /* Bit 26: Break disarm */
#define ATIM_BDTR_BK2_DSRM             (1 << 27)                          /* Bit 27: Break 2 disarm */
#define ATIM_BDTR_BK_BID               (1 << 28)                          /* Bit 28: Break bidirectional */
#define ATIM_BDTR_BK2_BID              (1 << 29)                          /* Bit 29: Break 2 bidirectional */

/* ATIM Dead-time register 2 (DTR2) */

#define ATIM_DTR2_DTGF_SHIFT           (0)                                /* Dead time falling edge generator setup */
#define ATIM_DTR2_DTGF_MASK            (0xff << ATIM_DTR2_DTGF_SHIFT)
#define ATIM_DTR2_DTAE                 (1 << 16)                          /* Dead time asymmetric enable */
#define ATIM_DTR2_DTPE                 (1 << 17)                          /* Dead time preload enable */

/* ATIM Encoder control register (ECR) */

