apache/nuttx/arch/arm/src/stm32/hardware/stm32g47xxx_tim.h
/* Register Bitfield Definitions - GTIM *************************************/

/* GTIM: General Timers
 * 16-/32-bit General Timers with DMA: TIM2, TM3, TIM4, and TIM5
 * 16-bit General Timers with DMA: TIM15, TIM16, and TIM17
 *
 * Caution! TIM2/5, TIM3/4, TIM15, and TIM16/17 are slightly different and
 * have different registers, register sizes, and register bitfields!
 */

/* GTIM Control register 1 (CR1) */

#define GTIM_CR1_CEN                   (1 << 0)                           /* Bit 0: Counter enable */
#define GTIM_CR1_UDIS                  (1 << 1)                           /* Bit 1: Update disable */
#define GTIM_CR1_URS                   (1 << 2)                           /* Bit 2: Update request source */
#define GTIM_CR1_OPM                   (1 << 3)                           /* Bit 3: One pulse mode */
#define GTIM_CR1_DIR                   (1 << 4)                           /* Bit 4: Direction */
#define GTIM_CR1_CMS_SHIFT             (5)                                /* Bits 5-6: Center-aligned mode selection */
#define GTIM_CR1_CMS_MASK              (0x3 << GTIM_CR1_CMS_SHIFT)
#  define GTIM_CR1_EDGE                (0x0 << GTIM_CR1_CMS_SHIFT)        /* 00: Edge-aligned mode */
#  define GTIM_CR1_CENTER1             (0x1 << GTIM_CR1_CMS_SHIFT)        /* 01: Center-aligned mode 1 */
#  define GTIM_CR1_CENTER2             (0x2 << GTIM_CR1_CMS_SHIFT)        /* 10: Center-aligned mode 2 */
#  define GTIM_CR1_CENTER3             (0x3 << GTIM_CR1_CMS_SHIFT)        /* 11: Center-aligned mode 3 */
#define GTIM_CR1_ARPE                  (1 << 7)                           /* Bit 7: Auto-reload preload enable */
#define GTIM_CR1_CKD_SHIFT             (8)                                /* Bits 8-9: Clock division */
#define GTIM_CR1_CKD_MASK              (0x3 << GTIM_CR1_CKD_SHIFT)
#  define GTIM_CR1_TCKINT              (0x0 << GTIM_CR1_CKD_SHIFT)        /* 00: tDTS=1*tCK_INT */
#  define GTIM_CR1_2TCKINT             (0x1 << GTIM_CR1_CKD_SHIFT)        /* 01: tDTS=2*tCK_INT */
#  define GTIM_CR1_4TCKINT             (0x2 << GTIM_CR1_CKD_SHIFT)        /* 10: tDTS=4*tCK_INT */
#define GTIM_CR1_UIFREMAP              (1 << 11)                          /* Bit 11: UIF status bit remapping */
#define GTIM_CR1_DITHEN                (1 << 12)                          /* Bit 12: Dithering enable */

/* GTIM Control register 2 (CR2) */

#define GTIM_CR2_CCDS                  (1 << 3)                           /* Bit 3: Capture/Compare DMA Selection */
#define GTIM_CR2_MMS_SHIFT             (4)                                /* Bits 4-6: Master Mode Selection */
#define GTIM_CR2_MMS_MASK              (0x200007 << GTIM_CR2_MMS_SHIFT)
#  define GTIM_CR2_MMS_RESET           (0x0 << GTIM_CR2_MMS_SHIFT)        /* 0000: Reset - TIMx_EGR UG bit is TRGO */
#  define GTIM_CR2_MMS_ENABLE          (0x1 << GTIM_CR2_MMS_SHIFT)        /* 0001: Enable - CNT_EN is TRGO */
#  define GTIM_CR2_MMS_UPDATE          (0x2 << GTIM_CR2_MMS_SHIFT)        /* 0010: Update event is TRGO */
#  define GTIM_CR2_MMS_COMPP           (0x3 << GTIM_CR2_MMS_SHIFT)        /* 0010: Compare Pulse - CC1IF flag */
#  define GTIM_CR2_MMS_OC1REF          (0x4 << GTIM_CR2_MMS_SHIFT)        /* 0100: Compare OC1REF is TRGO */
#  define GTIM_CR2_MMS_OC2REF          (0x5 << GTIM_CR2_MMS_SHIFT)        /* 0101: Compare OC2REF is TRGO */
#  define GTIM_CR2_MMS_OC3REF          (0x6 << GTIM_CR2_MMS_SHIFT)        /* 0110: Compare OC3REF is TRGO */
#  define GTIM_CR2_MMS_OC4REF          (0x7 << GTIM_CR2_MMS_SHIFT)        /* 0111: Compare OC4REF is TRGO */
#  define GTIM_CR2_MMS_ENCODER         (0x200000 << GTIM_CR2_MMS_SHIFT)   /* 1000: Encoder clock is TRGO */
#define GTIM_CR2_TI1S                  (1 << 7)                           /* Bit 7: TI1 Selection */

/* GTIM Slave mode control register (SMCR) */

#define GTIM_SMCR_SMS_SHIFT            (0)                                /* Bits 0-2: Slave mode selection */
#define GTIM_SMCR_SMS_MASK             (0x10007 << GTIM_SMCR_SMS_SHIFT)
#  define GTIM_SMCR_DISAB              (0x0 << GTIM_SMCR_SMS_SHIFT)       /* 0000: Slave mode disabled */
#  define GTIM_SMCR_ENCMD1             (0x1 << GTIM_SMCR_SMS_SHIFT)       /* 0001: Encoder mode 1 */
#  define GTIM_SMCR_ENCMD2             (0x2 << GTIM_SMCR_SMS_SHIFT)       /* 0010: Encoder mode 2 */
#  define GTIM_SMCR_ENCMD3             (0x3 << GTIM_SMCR_SMS_SHIFT)       /* 0011: Encoder mode 3 */
#  define GTIM_SMCR_RESET              (0x4 << GTIM_SMCR_SMS_SHIFT)       /* 0100: Reset Mode */
#  define GTIM_SMCR_GATED              (0x5 << GTIM_SMCR_SMS_SHIFT)       /* 0101: Gated Mode */
#  define GTIM_SMCR_TRIGGER            (0x6 << GTIM_SMCR_SMS_SHIFT)       /* 0110: Trigger Mode */
#  define GTIM_SMCR_EXTCLK1            (0x7 << GTIM_SMCR_SMS_SHIFT)       /* 0111: External Clock Mode 1 */
#  define GTIM_SMCR_RESET_TRIGGER      (0x10000 << GTIM_SMCR_SMS_SHIFT)   /* 1000: Combined reset + trigger */
#  define GTIM_SMCR_GATED_RESET        (0x10001 << GTIM_SMCR_SMS_SHIFT)   /* 1001: Combined gated + reset */
#  define GTIM_SMCR_ENCMD4             (0x10002 << GTIM_SMCR_SMS_SHIFT)   /* 1010: Encoder mode 4 */
#  define GTIM_SMCR_ENCMD5             (0x10003 << GTIM_SMCR_SMS_SHIFT)   /* 1011: Encoder mode 5 */
#  define GTIM_SMCR_ENCMD6             (0x10004 << GTIM_SMCR_SMS_SHIFT)   /* 1100: Encoder mode 6 */
#  define GTIM_SMCR_ENCMD7             (0x10005 << GTIM_SMCR_SMS_SHIFT)   /* 1101: Encoder mode 7 */
#  define GTIM_SMCR_ENCMD8             (0x10006 << GTIM_SMCR_SMS_SHIFT)   /* 1110: Encoder mode 8 */
#  define GTIM_SMCR_ENCMD9             (0x10007 << GTIM_SMCR_SMS_SHIFT)   /* 1111: Encoder mode 9 */
#define GTIM_SMCR_TS_SHIFT             (4)                                /* Bits 4-6: Trigger selection */
#define GTIM_SMCR_TS_MASK              (0x30007 << GTIM_SMCR_TS_SHIFT)
#  define GTIM_SMCR_ITR0               (0x0 << GTIM_SMCR_TS_SHIFT)        /* 00 000: Internal trigger 0 (ITR0) */
#  define GTIM_SMCR_ITR1               (0x1 << GTIM_SMCR_TS_SHIFT)        /* 00 001: Internal trigger 1 (ITR1) */
#  define GTIM_SMCR_ITR2               (0x2 << GTIM_SMCR_TS_SHIFT)        /* 00 010: Internal trigger 2 (ITR2) */
#  define GTIM_SMCR_ITR3               (0x3 << GTIM_SMCR_TS_SHIFT)        /* 00 011: Internal trigger 3 (ITR3) */
#  define GTIM_SMCR_T1FED              (0x4 << GTIM_SMCR_TS_SHIFT)        /* 00 100: TI1 Edge Detector (TI1F_ED) */
#  define GTIM_SMCR_TI1FP1             (0x5 << GTIM_SMCR_TS_SHIFT)        /* 00 101: Filtered Timer Input 1 (TI1FP1) */
#  define GTIM_SMCR_T12FP2             (0x6 << GTIM_SMCR_TS_SHIFT)        /* 00 110: Filtered Timer Input 2 (TI2FP2) */
#  define GTIM_SMCR_ETRF               (0x7 << GTIM_SMCR_TS_SHIFT)        /* 00 111: External Trigger Input (ETRF) */
#  define GTIM_SMCR_ITR4               (0x1000 << GTIM_SMCR_TS_SHIFT)     /* 01 000: Internal Trigger 0 ITR4 */
#  define GTIM_SMCR_ITR5               (0x1001 << GTIM_SMCR_TS_SHIFT)     /* 01 001: Internal Trigger 1 ITR5 */
#  define GTIM_SMCR_ITR6               (0x1002 << GTIM_SMCR_TS_SHIFT)     /* 01 010: Internal Trigger 1 ITR6 */
#  define GTIM_SMCR_ITR7               (0x1003 << GTIM_SMCR_TS_SHIFT)     /* 01 011: Internal Trigger 1 ITR7 */
#  define GTIM_SMCR_ITR8               (0x1004 << GTIM_SMCR_TS_SHIFT)     /* 01 100: Internal Trigger 1 ITR8 */
#  define GTIM_SMCR_ITR9               (0x1005 << GTIM_SMCR_TS_SHIFT)     /* 01 101: Internal Trigger 1 ITR9 */
#  define GTIM_SMCR_ITR10              (0x1006 << GTIM_SMCR_TS_SHIFT)     /* 01 110: Internal Trigger 1 ITR10 */
#define GTIM_SMCR_MSM                  (1 << 7)                           /* Bit 7: Master/slave mode */
#define GTIM_SMCR_ETF_SHIFT            (8)                                /* Bits 8-11: External trigger filter */
#define GTIM_SMCR_ETF_MASK             (0xf << GTIM_SMCR_ETF_SHIFT)
#  define GTIM_SMCR_NOFILT             (0x0 << GTIM_SMCR_ETF_SHIFT)       /* 0000: No filter, sampling is done at fDTS */
#  define GTIM_SMCR_FCKINT2            (0x1 << GTIM_SMCR_ETF_SHIFT)       /* 0001: fSAMPLING=fCK_INT, N=2 */
#  define GTIM_SMCR_FCKINT4            (0x2 << GTIM_SMCR_ETF_SHIFT)       /* 0010: fSAMPLING=fCK_INT, N=4 */
#  define GTIM_SMCR_FCKINT8            (0x3 << GTIM_SMCR_ETF_SHIFT)       /* 0011: fSAMPLING=fCK_INT, N=8 */
#  define GTIM_SMCR_FDTSd26            (0x4 << GTIM_SMCR_ETF_SHIFT)       /* 0100: fSAMPLING=fDTS/2, N=6 */
#  define GTIM_SMCR_FDTSd28            (0x5 << GTIM_SMCR_ETF_SHIFT)       /* 0101: fSAMPLING=fDTS/2, N=8 */
#  define GTIM_SMCR_FDTSd46            (0x6 << GTIM_SMCR_ETF_SHIFT)       /* 0110: fSAMPLING=fDTS/4, N=6 */
#  define GTIM_SMCR_FDTSd48            (0x7 << GTIM_SMCR_ETF_SHIFT)       /* 0111: fSAMPLING=fDTS/4, N=8 */
#  define GTIM_SMCR_FDTSd86            (0x8 << GTIM_SMCR_ETF_SHIFT)       /* 1000: fSAMPLING=fDTS/8, N=6 */
#  define GTIM_SMCR_FDTSd88            (0x9 << GTIM_SMCR_ETF_SHIFT)       /* 1001: fSAMPLING=fDTS/8, N=8 */
#  define GTIM_SMCR_FDTSd165           (0xa << GTIM_SMCR_ETF_SHIFT)       /* 1010: fSAMPLING=fDTS/16, N=5 */
#  define GTIM_SMCR_FDTSd166           (0xb << GTIM_SMCR_ETF_SHIFT)       /* 1011: fSAMPLING=fDTS/16, N=6 */
#  define GTIM_SMCR_FDTSd168           (0xc << GTIM_SMCR_ETF_SHIFT)       /* 1100: fSAMPLING=fDTS/16, N=8 */
#  define GTIM_SMCR_FDTSd325           (0xd << GTIM_SMCR_ETF_SHIFT)       /* 1101: fSAMPLING=fDTS/32, N=5 */
#  define GTIM_SMCR_FDTSd326           (0xe << GTIM_SMCR_ETF_SHIFT)       /* 1110: fSAMPLING=fDTS/32, N=6 */
#  define GTIM_SMCR_FDTSd328           (0xf << GTIM_SMCR_ETF_SHIFT)       /* 1111: fSAMPLING=fDTS/32, N=8 */
#define GTIM_SMCR_ETPS_SHIFT           (12)                               /* Bits 12-13: External trigger prescaler */
#define GTIM_SMCR_ETPS_MASK            (0x3 << GTIM_SMCR_ETPS_SHIFT)
#  define GTIM_SMCR_PSCOFF             (0x0 << GTIM_SMCR_ETPS_SHIFT)      /* 00: Prescaler OFF */
#  define GTIM_SMCR_ETRPd2             (0x1 << GTIM_SMCR_ETPS_SHIFT)      /* 01: ETRP frequency divided by 2 */
#  define GTIM_SMCR_ETRPd4             (0x2 << GTIM_SMCR_ETPS_SHIFT)      /* 10: ETRP frequency divided by 4 */
#  define GTIM_SMCR_ETRPd8             (0x3 << GTIM_SMCR_ETPS_SHIFT)      /* 11: ETRP frequency divided by 8 */
#define GTIM_SMCR_ECE                  (1 << 14)                          /* Bit 14: External clock enable */
#define GTIM_SMCR_ETP                  (1 << 15)                          /* Bit 15: External trigger polarity */
#define GTIM_SMCR_SMS                  (1 << 16)                          /* Bit 16: Slave mode selection - bit 3 */
#define GTIM_SMCR_SMSPE                (1 << 24)                          /* Bit 24: SMS preload enable */
#define GTIM_SMCR_SMSPS                (1 << 25)                          /* Bit 25: SMS preload source */

