apache/nuttx/arch/arm/src/stm32/hardware/stm32g47xxx_tim.h
/* GTIM DMA/Interrupt enable register (DIER) */

#define GTIM_DIER_UIE                  (1 << 0)                           /* Bit 0: Update interrupt enable */
#define GTIM_DIER_CC1IE                (1 << 1)                           /* Bit 1: Capture/Compare 1 interrupt enable */
#define GTIM_DIER_CC2IE                (1 << 2)                           /* Bit 2: Capture/Compare 2 interrupt enable */
#define GTIM_DIER_CC3IE                (1 << 3)                           /* Bit 3: Capture/Compare 3 interrupt enable */
#define GTIM_DIER_CC4IE                (1 << 4)                           /* Bit 4: Capture/Compare 4 interrupt enable */
#define GTIM_DIER_TIE                  (1 << 6)                           /* Bit 6: Trigger interrupt enable */
#define GTIM_DIER_UDE                  (1 << 8)                           /* Bit 8: Update DMA request enable */
#define GTIM_DIER_CC1DE                (1 << 9)                           /* Bit 9: Capture/Compare 1 DMA request enable */
#define GTIM_DIER_CC2DE                (1 << 10)                          /* Bit 10: Capture/Compare 2 DMA request enable */
#define GTIM_DIER_CC3DE                (1 << 11)                          /* Bit 11: Capture/Compare 3 DMA request enable */
#define GTIM_DIER_CC4DE                (1 << 12)                          /* Bit 12: Capture/Compare 4 DMA request enable */
#define GTIM_DIER_COMDE                (1 << 13)                          /* Bit 13: COM DMA request enable */
#define GTIM_DIER_TDE                  (1 << 14)                          /* Bit 14: Trigger DMA request enable */
#define GTIM_DIER_IDXIE                (1 << 20)                          /* Bit 20: Index interrupt enable */
#define GTIM_DIER_DIRIE                (1 << 21)                          /* Bit 21: Direction change interrupt enable */
#define GTIM_DIER_IERRIE               (1 << 22)                          /* Bit 22: Index error interrupt enable */
#define GTIM_DIER_TERRIE               (1 << 23)                          /* Bit 23: Transition error interrupt enable */

/* GTIM Status register (SR) */

#define GTIM_SR_UIF                    (1 << 0)                           /* Bit 0: Update Interrupt Flag */
#define GTIM_SR_CC1IF                  (1 << 1)                           /* Bit 1: Capture/Compare 1 Interrupt Flag */
#define GTIM_SR_CC2IF                  (1 << 2)                           /* Bit 2: Capture/Compare 2 Interrupt Flag */
#define GTIM_SR_CC3IF                  (1 << 3)                           /* Bit 3: Capture/Compare 3 Interrupt Flag */
#define GTIM_SR_CC4IF                  (1 << 4)                           /* Bit 4: Capture/Compare 4 Interrupt Flag */
#define GTIM_SR_TIF                    (1 << 6)                           /* Bit 6: Trigger Interrupt Flag */
#define GTIM_SR_CC1OF                  (1 << 9)                           /* Bit 9: Capture/Compare 1 Overcapture Flag */
#define GTIM_SR_CC2OF                  (1 << 10)                          /* Bit 10: Capture/Compare 2 Overcapture Flag */
#define GTIM_SR_CC3OF                  (1 << 11)                          /* Bit 11: Capture/Compare 3 Overcapture Flag */
#define GTIM_SR_CC4OF                  (1 << 12)                          /* Bit 12: Capture/Compare 4 Overcapture Flag */
#define GTIM_SR_IDXF                   (1 << 20)                          /* Bit 20: Index Interrupt Flag */
#define GTIM_SR_DIRF                   (1 << 21)                          /* Bit 21: Direction Change Interrupt Flag */
#define GTIM_SR_IERRF                  (1 << 22)                          /* Bit 22: Index Error Interrupt Flag */
#define GTIM_SR_TERRF                  (1 << 23)                          /* Bit 23: Transition Error Interrupt Flag */

/* GTIM Event generation register (EGR) */

#define GTIM_EGR_UG                    (1 << 0)                           /* Bit 0: Update Generation */
#define GTIM_EGR_CC1G                  (1 << 1)                           /* Bit 1: Capture/Compare 1 Generation */
#define GTIM_EGR_CC2G                  (1 << 2)                           /* Bit 2: Capture/Compare 2 Generation */
#define GTIM_EGR_CC3G                  (1 << 3)                           /* Bit 3: Capture/Compare 3 Generation */
#define GTIM_EGR_CC4G                  (1 << 4)                           /* Bit 4: Capture/Compare 4 Generation */
#define GTIM_EGR_TG                    (1 << 6)                           /* Bit 6: Trigger Generation */

/* GTIM Capture/compare mode registers (CCMR1) - Output Compare Mode */

#define GTIM_CCMR1_CC1S_SHIFT          (0)                                /* Bits 0-1: Capture/Compare 1 Selection */
#define GTIM_CCMR1_CC1S_MASK           (3 << GTIM_CCMR1_CC1S_SHIFT)       /* (See common (unshifted) bit field definitions below) */
#define GTIM_CCMR1_OC1FE               (1 << 2)                           /* Bit 2: Output Compare 1 Fast enable */
#define GTIM_CCMR1_OC1PE               (1 << 3)                           /* Bit 3: Output Compare 1 Preload enable */
#define GTIM_CCMR1_OC1M_SHIFT          (4)                                /* Bits 4-6: Output Compare 1 Mode */
#define GTIM_CCMR1_OC1M_MASK           (7 << GTIM_CCMR1_OC1M_SHIFT)       /* (See common (unshifted) bit field definitions below) */
#define GTIM_CCMR1_OC1CE               (1 << 7)                           /* Bit 7: Output Compare 1Clear Enable */
#define GTIM_CCMR1_CC2S_SHIFT          (8)                                /* Bits 8-9: Capture/Compare 2 Selection */
#define GTIM_CCMR1_CC2S_MASK           (3 << GTIM_CCMR1_CC2S_SHIFT)       /* (See common (unshifted) bit field definitions below) */
#define GTIM_CCMR1_OC2FE               (1 << 10)                          /* Bit 10: Output Compare 2 Fast enable */
#define GTIM_CCMR1_OC2PE               (1 << 11)                          /* Bit 11: Output Compare 2 Preload enable */
#define GTIM_CCMR1_OC2M_SHIFT          (12)                               /* Bits 12-14: Output Compare 2 Mode */
#define GTIM_CCMR1_OC2M_MASK           (7 << GTIM_CCMR1_OC2M_SHIFT)       /* (See common (unshifted) bit field definitions below) */
#define GTIM_CCMR1_OC2CE               (1 << 15)                          /* Bit 15: Output Compare 2 Clear Enable */
#define GTIM_CCMR1_OC1M                (1 << 16)                          /* Bit 16: Output Compare 1 mode - bit 3 */
#define GTIM_CCMR1_OC2M                (1 << 24)                          /* Bit 24: Output Compare 2 mode - bit 3 */

/* GTIM Common CCMR (unshifted) Capture/Compare Selection
 * bit-field definitions
 */

#define GTIM_CCMR_CCS_CCOUT            (0x0)                              /* 00: CCx channel  output */
#define GTIM_CCMR_CCS_CCIN1            (0x1)                              /* 01: CCx channel input, ICx is TIx */
#define GTIM_CCMR_CCS_CCIN2            (0x2)                              /* 10: CCx channel input, ICx is TIy */
#define GTIM_CCMR_CCS_CCINTRC          (0x3)                              /* 11: CCx channel input, ICx is TRC */

/* GTIM Common CCMR (unshifted) Compare Mode bit field definitions */

