apache/nuttx/arch/arm/src/stm32/hardware/stm32g47xxx_tim.h
#define GTIM_PSC_SHIFT                 (0)
#define GTIM_PSC_MASK                  (0xffff << GTIM_PSC_SHIFT)         /* Bits 0-15: Prescaler value */

/* GTIM Auto-reload register (ARR) */

#define GTIM_ARR_SHIFT                 (0)
#define GTIM_ARR_MASK_20               (0xfffff << GTIM_ARR_SHIFT)        /* Bits 0-19: Auto reload register */
#define GTIM_ARR_MASK_32               (0xffffffff << GTIM_ARR_SHIFT)     /* Bits 0-31: Auto reload register, 32-bit counters only */

/* GTIM Repetition counter register (16-bit, TIM15 only) */

#define GTIM_RCR_SHIFT                 (0)
#define GTIM_RCR_MASK                  (0xff << GTIM_RCR_SHIFT)

/* GTIM Capture/compare register 1 (CCR1 - CCR4) */

#define GTIM_CCR_SHIFT                 (0)
#define GTIM_CCR_MASK_20               (0xfffff << GTIM_CCR_SHIFT)        /* Bits 0-19: Capture/compare 1 value */
#define GTIM_CCR_MASK_32               (0xffffffff << GTIM_CCR_SHIFT)     /* Bits 0-31: Capture/compare 1 value, 32-bit timers only */

/* GTIM Break and dead-time register (BDTR) - TIM15-TIM17 only */

#define GTIM_BDTR_DTG_SHIFT            (0)                                /* Bits 0-7: Dead-Time Generator set-up */
#define GTIM_BDTR_DTG_MASK             (0xff << GTIM_BDTR_DTG_SHIFT)
#define GTIM_BDTR_LOCK_SHIFT           (8)                                /* Bits 8-9: Lock Configuration */
#define GTIM_BDTR_LOCK_MASK            (3 << GTIM_BDTR_LOCK_SHIFT)
#  define GTIM_BDTR_LOCKOFF            (0 << GTIM_BDTR_LOCK_SHIFT)        /* 00: LOCK OFF - No bit is write protected */
#  define GTIM_BDTR_LOCK1              (1 << GTIM_BDTR_LOCK_SHIFT)        /* 01: LOCK Level 1 protection */
#  define GTIM_BDTR_LOCK2              (2 << GTIM_BDTR_LOCK_SHIFT)        /* 10: LOCK Level 2 protection */
#  define GTIM_BDTR_LOCK3              (3 << GTIM_BDTR_LOCK_SHIFT)        /* 11: LOCK Level 3 protection */
#define GTIM_BDTR_OSSI                 (1 << 10)                          /* Bit 10: Off-State Selection for Idle mode */
#define GTIM_BDTR_OSSR                 (1 << 11)                          /* Bit 11: Off-State Selection for Run mode */
#define GTIM_BDTR_BKE                  (1 << 12)                          /* Bit 12: Break enable */
#define GTIM_BDTR_BKP                  (1 << 13)                          /* Bit 13: Break Polarity */
#define GTIM_BDTR_AOE                  (1 << 14)                          /* Bit 14: Automatic Output enable */
#define GTIM_BDTR_MOE                  (1 << 15)                          /* Bit 15: Main Output enable */

#define GTIM_BDTR_BKF_SHIFT            (16)                               /* Bits 16-19: Break filter */
#define GTIM_BDTR_BKF_MASK             (15 << GTIM_BDTR_BKF_SHIFT)
#  define GTIM_BDTR_BKF_NOFILT         (0 << GTIM_BDTR_BKF_SHIFT)         /* 0000: No filter, BRK acts asynchronously */
#  define GTIM_BDTR_BKF_FCKINT2        (1 << GTIM_BDTR_BKF_SHIFT)         /* 0001: fSAMPLING=fCK_INT, N=2 */
#  define GTIM_BDTR_BKF_FCKINT4        (2 << GTIM_BDTR_BKF_SHIFT)         /* 0010: fSAMPLING=fCK_INT, N=4 */
#  define GTIM_BDTR_BKF_FCKINT8        (3 << GTIM_BDTR_BKF_SHIFT)         /* 0011: fSAMPLING=fCK_INT, N=8 */
#  define GTIM_BDTR_BKF_FDTSd26        (4 << GTIM_BDTR_BKF_SHIFT)         /* 0100: fSAMPLING=fDTS/2, N=6 */
#  define GTIM_BDTR_BKF_FDTSd28        (5 << GTIM_BDTR_BKF_SHIFT)         /* 0101: fSAMPLING=fDTS/2, N=8 */
#  define GTIM_BDTR_BKF_FDTSd36        (6 << GTIM_BDTR_BKF_SHIFT)         /* 0110: fSAMPLING=fDTS/4, N=6 */
#  define GTIM_BDTR_BKF_FDTSd38        (7 << GTIM_BDTR_BKF_SHIFT)         /* 0111: fSAMPLING=fDTS/4, N=8 */
#  define GTIM_BDTR_BKF_FDTSd86        (8 << GTIM_BDTR_BKF_SHIFT)         /* 1000: fSAMPLING=fDTS/8, N=6 */
#  define GTIM_BDTR_BKF_FDTSd88        (9 << GTIM_BDTR_BKF_SHIFT)         /* 1001: fSAMPLING=fDTS/8, N=8 */
#  define GTIM_BDTR_BKF_FDTSd165       (10 << GTIM_BDTR_BKF_SHIFT)        /* 1010: fSAMPLING=fDTS/16, N=5 */
#  define GTIM_BDTR_BKF_FDTSd166       (11 << GTIM_BDTR_BKF_SHIFT)        /* 1011: fSAMPLING=fDTS/16, N=6 */
#  define GTIM_BDTR_BKF_FDTSd168       (12 << GTIM_BDTR_BKF_SHIFT)        /* 1100: fSAMPLING=fDTS/16, N=8 */
#  define GTIM_BDTR_BKF_FDTSd325       (13 << GTIM_BDTR_BKF_SHIFT)        /* 1101: fSAMPLING=fDTS/32, N=5 */
#  define GTIM_BDTR_BKF_FDTSd326       (14 << GTIM_BDTR_BKF_SHIFT)        /* 1110: fSAMPLING=fDTS/32, N=6 */
#  define GTIM_BDTR_BKF_FDTSd328       (15 << GTIM_BDTR_BKF_SHIFT)        /* 1111: fSAMPLING=fDTS/32, N=8 */
#define GTIM_BDTR_BK_DSRM              (1 << 26)                          /* Bit 26: Break disarm */
#define GTIM_BDTR_BK_BID               (1 << 28)                          /* Bit 28: Break bidirectional */

/* GTIM Option register 1 (OR1) - TIM16, TIM17 only */

#define GTIM_OR1_HSE32EN               (1 << 0)                           /* Bit 1: HSE divide by 32 for tim_ti1_in3 */

/* GTIM Dead-time register 2 (DTR2) */

#define GTIM_DTR2_DTGF_SHIFT           (0)                                /* Dead time falling edge generator setup */
#define GTIM_DTR2_DTGF_MASK            (0xff << GTIM_DTR2_DTGF_SHIFT)
#define GTIM_DTR2_DTAE                 (1 << 16)                          /* Dead time asymmetric enable */
#define GTIM_DTR2_DTPE                 (1 << 17)                          /* Dead time preload enable */

/* GTIM Encoder control register (ECR) */

#define GTIM_ECR_IE                    (1 << 0)                           /* Index enable (indicates if index resets counter): 0=no, 1=yes */
#define GTIM_ECR_IDIR_SHIFT            (1)                                /* Index direction */
#define GTIM_ECR_IDIR_MASK             (0x3 << GTIM_ECR_IDIR_SHIFT)
#  define GTIM_ECR_IDIR_BOTH           (0x0 << GTIM_ECR_IDIR_SHIFT)       /* Index resets the counter in both directions */
#  define GTIM_ECR_IDIR_UP             (0x1 << GTIM_ECR_IDIR_SHIFT)       /* Index resets the counter when counting up */
#  define GTIM_ECR_IDIR_DOWN           (0x2 << GTIM_ECR_IDIR_SHIFT)       /* Index resets the counter when counting down */
#define GTIM_ECR_FIDX                  (1 << 5)                           /* First index: 0=index always resets counter, 1=only first index resets counter */
#define GTIM_ECR_IPOS_SHIFT            (6)                                /* Index reset position */
#define GTIM_ECR_IPOS_MASK             (0x3 << GTIM_ECR_IPOS_SHIFT)
#  define GTIM_ECR_IPOS_00             (0x0 << GTIM_ECR_IPOS_SHIFT)       /* Index resets position when channels A,B = 0,0 */
#  define GTIM_ECR_IPOS_01             (0x1 << GTIM_ECR_IPOS_SHIFT)       /* Index resets position when channels A,B = 0,1 */
#  define GTIM_ECR_IPOS_10             (0x2 << GTIM_ECR_IPOS_SHIFT)       /* Index resets position when channels A,B = 1,0 */
#  define GTIM_ECR_IPOS_11             (0x3 << GTIM_ECR_IPOS_SHIFT)       /* Index resets position when channels A,B = 1,1 */
#define GTIM_ECR_PW_SHIFT              (16)                               /* Pulse duration in units of t[PWG], see GTIM_ECR_PWPRSC_MASK */
#define GTIM_ECR_PW_MASK               (0xff << GTIM_ECR_PW_SHIFT)
#define GTIM_ECR_PWPRSC_SHIFT          (24)                               /* Pulse width prescaler */
#define GTIM_ECR_PWPRSC_MASK           (0x7 << GTIM_ECR_PWPRSC_SHIFT)     /* t[PWG] = (2^(PWPRSC[2:0])) * t[tim_ker_ck] */

/* GTIM Timer input selection register (TISEL) */

