apache/nuttx/arch/arm/src/stm32/hardware/stm32g47xxx_tim.h
#define GTIM_TISEL_TI1SEL_SHIFT        (0) /* TIM2-TIM5, TIM15-TIM17 */
#define GTIM_TISEL_TI1SEL_MASK         (0xf << TIM_TISEL_TI1SEL_SHIFT)

#define GTIM_TISEL_TI2SEL_SHIFT        (8) /* TIM2-TIM5, TIM15 */
#define GTIM_TISEL_TI2SEL_MASK         (0xf << TIM_TISEL_TI2SEL_SHIFT)

#define GTIM_TISEL_TI3SEL_SHIFT        (16) /* TIM2-TIM5 */
#define GTIM_TISEL_TI3SEL_MASK         (0xf << TIM_TISEL_TI3SEL_SHIFT)

#define GTIM_TISEL_TI4SEL_SHIFT        (24) /* TIM2-TIM5 */
#define GTIM_TISEL_TI4SEL_MASK         (0xf << TIM_TISEL_TI4SEL_SHIFT)

/* GTIM Alternate function option register 1 (AF1) */

#define GTIM_AF1_BKINE                 (1 << 0)                           /* BRK BKIN input enable TIM15-TIM17 only */
#define GTIM_AF1_BKCMP1E               (1 << 1)                           /* BRK COMP1 enable TIM15-TIM17 only */
#define GTIM_AF1_BKCMP2E               (1 << 2)                           /* BRK COMP2 enable TIM15-TIM17 only */
#define GTIM_AF1_BKCMP3E               (1 << 3)                           /* BRK COMP3 enable TIM15-TIM17 only */
#define GTIM_AF1_BKCMP4E               (1 << 4)                           /* BRK COMP4 enable TIM15-TIM17 only */
#define GTIM_AF1_BKCMP5E               (1 << 5)                           /* BRK COMP5 enable TIM15-TIM17 only */
#define GTIM_AF1_BKCMP6E               (1 << 6)                           /* BRK COMP6 enable TIM15-TIM17 only */
#define GTIM_AF1_BKCMP7E               (1 << 7)                           /* BRK COMP7 enable TIM15-TIM17 only */
#define GTIM_AF1_BKINP                 (1 << 9)                           /* BRK BKIN input polarity TIM15-TIM17 only */
#define GTIM_AF1_BKCMP1P               (1 << 10)                          /* BRK COMP1 input polarity TIM15-TIM17 only */
#define GTIM_AF1_BKCMP2P               (1 << 11)                          /* BRK COMP2 input polarity TIM15-TIM17 only */
#define GTIM_AF1_BKCMP3P               (1 << 12)                          /* BRK COMP3 input polarity TIM15-TIM17 only */
#define GTIM_AF1_BKCMP4P               (1 << 13)                          /* BRK COMP4 input polarity TIM15-TIM17 only */
#define GTIM_AF1_ETRSEL_SHIFT          (14)                               /* ETR source selection) TIM2-TIM5 only */
#define GTIM_AF1_ETRSEL_MASK           (0xf << TIM1_AF1_ETRSEL_Pos)

/* GTIM Alternate function option register 2 (AF2) */

#define GTIM_AF2_OCRSEL_SHIFT          (16)                               /* ocref_clr source selection */
#define GTIM_AF2_OCRSEL_MASK           (0x7 << TIM1_AF2_OCRSEL_Pos)

/* GTIM DMA control register (DCR) */

#define GTIM_DCR_DBA_SHIFT             (0)                                /* Bits 0-4: DMA Base Address */
#define GTIM_DCR_DBA_MASK              (0x1f << GTIM_DCR_DBA_SHIFT)
#define GTIM_DCR_DBL_SHIFT             (8)                                /* Bits 8-12: DMA Burst Length */
#define GTIM_DCR_DBL_MASK              (0x1f << GTIM_DCR_DBL_SHIFT)
#  define GTIM_DCR_DBL(n)              (((n) - 1) << GTIM_DCR_DBL_SHIFT)  /* n transfers, n = 1..18 */

/* Register Bitfield Definitions - BTIM *************************************/

/* BTIM: Basic Timers - TIM6 and TIM7 */

/* BTIM Control register 1 (CR1) */

#define BTIM_CR1_CEN                   (1 << 0)                           /* Bit 0: Counter Enable */
#define BTIM_CR1_UDIS                  (1 << 1)                           /* Bit 1: Update Disable */
#define BTIM_CR1_URS                   (1 << 2)                           /* Bit 2: Update Request Source */
#define BTIM_CR1_OPM                   (1 << 3)                           /* Bit 3: One Pulse Mode */
#define BTIM_CR1_ARPE                  (1 << 7)                           /* Bit 7: Auto-Reload Preload enable */
#define BTIM_CR1_UIFREMAP              (1 << 11)                          /* Bit 11: UIF status bit remapping: 1=copy UIF bit to bit 32 of CNT register */
#define BTIM_CR1_DITHEN                (1 << 12)                          /* Bit 12: Dithering Enable (can change only when CEN bit is 0) */

/* BTIM Control register 2 (CR2) */

#define BTIM_CR2_MMS_SHIFT             (4)                                /* Bits 4-6: Master Mode Selection */
#define BTIM_CR2_MMS_MASK              (0x7 << BTIM_CR2_MMS_SHIFT)
#  define BTIM_CR2_RESET               (0x0 << BTIM_CR2_MMS_SHIFT)        /* 000: Reset */
#  define BTIM_CR2_ENAB                (0x1 << BTIM_CR2_MMS_SHIFT)        /* 001: Enable */
#  define BTIM_CR2_UPDT                (0x2 << BTIM_CR2_MMS_SHIFT)        /* 010: Update */

/* BTIM DMA/Interrupt enable register (DIER) */

#define BTIM_DIER_UIE                  (1 << 0)                           /* Bit 0: Update interrupt enable */
#define BTIM_DIER_UDE                  (1 << 8)                           /* Bit 8: Update DMA request enable */

/* BTIM Status register (SR) */

#define BTIM_SR_UIF                    (1 << 0)                           /* Bit 0: Update Interrupt Flag */

/* BTIM Event generation register (EGR) */

#define BTIM_EGR_UG                    (1 << 0)                           /* Bit 0: Update Generation */

/* BTIM Counter (CNT) */

#define BTIM_CNT_SHIFT                 (0)                                /* Bits 0-15: 16-bit timer counter value */
#define BTIM_CNT_MASK                  (0xffff << BTIM_CNT_SHIFT)
#define BTIM_CCER_UIFCPY               (1 << 31)                          /* Bit 31: UIF copy, if BTIM_CR1_UIFREMAP */

/* BTIM Prescaler (PSC) */

#define BTIM_PSC_SHIFT                 (0)
#define BTIM_PSC_MASK                  (0xffff << BTIM_PSC_SHIFT)         /* Bits 0-15: Prescaler value */

/* BTIM Auto-reload register (ARR) */

#define BTIM_ARR_SHIFT                 (0)                                /* Bits 0-15 or 0-19: Auto reload register */
#define BTIM_ARR_MASK_16               (0xffff << BTIM_ARR_SHIFT)         /* Bits 0-15: Auto reload register */
#define BTIM_ARR_MASK_20               (0xfffff << BTIM_ARR_SHIFT)        /* Bits 0-19: Auto reload register when BTIM_CR1_DITHEN */

#endif /* CONFIG_STM32_STM32G47XX */
#endif /* __ARCH_ARM_SRC_STM32_HARDWARE_STM32G47XXX_TIM_H */
